TexasInstruments/f29h85x-sdk/examples/driverlib/single_core/flash/F29H85x_EEPROM/F29H85x_EEPROM.c
//###########################################################################
//
// FILE:    F29H85x_EEPROM.c
//
// TITLE:   EEPROM Driver Logic
//! <h1> EEPROM Driver Logic </h1>
//
//###########################################################################
//
//
// //
//	Copyright: Copyright (C) Texas Instruments Incorporated
//	All rights reserved not granted herein.
//
//  Redistribution and use in source and binary forms, with or without 
//  modification, are permitted provided that the following conditions 
//  are met:
//
//  Redistributions of source code must retain the above copyright 
//  notice, this list of conditions and the following disclaimer.
//
//  Redistributions in binary form must reproduce the above copyright
//  notice, this list of conditions and the following disclaimer in the 
//  documentation and/or other materials provided with the   
//  distribution.
//
//  Neither the name of Texas Instruments Incorporated nor the names of
//  its contributors may be used to endorse or promote products derived
//  from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//

//#############################################################################

#include <F29H85x_EEPROM_Config.h>

// ==== Global Config + State Variables ==== //

//
// Page Mode-Only State
//
uint8_t Bank_Status[WRITE_SIZE_BYTES] = {0};
uint8_t Page_Status[WRITE_SIZE_BYTES] = {0};
uint8_t *Bank_Pointer;
uint8_t *Page_Pointer;
uint8_t Bank_Counter = 0;
uint8_t Page_Counter = 0;
uint32_t Bank_Size;
uint32_t status_buffer_len = WRITE_SIZE_BYTES;

//
// Both
//
uint8_t Erase_Blank_Check = 1;
uint8_t Empty_EEPROM = 1;
uint32_t WE_Protection_A_Mask;
uint32_t WE_Protection_B_Mask;
uint32_t NUM_EEPROM_SECTORS;
uint32_t FIRST_AND_LAST_SECTOR[2] = {0,0};

//
// The length passed to the blank check function, proper computation
// requires a division, so the below is a placeholder value.
// It is properly set in main()
//
uint32_t BLANK_CHECK_LEN = FLASH_SECTOR_SIZE;

//
// Precompute and cache the length passed to the blank check function
// The number of bytes must be divided by 4 because the length is
// treated as a 32-bit length
//
uint32_t VERIFY_LEN = WRITE_SIZE_BYTES / 4;

void Fill_Buffer(uint8_t* buffer, int buffer_len, uint8_t value)
{
    //
    // Fill the buffer array with the specified value
    //
    uint8_t i;
    for (i = 0; i < buffer_len; i++)
    {
        buffer[i] = value;
    }
}

int EEPROM_Config_Check(void) {
    //
    // If not using the data bank, return an error.
    // EEPROM emulation is only valid in the data bank.
    //
    if (FLASH_BANK_SELECT != C29FlashBankFR4RP0StartAddress)
    {
        return 0xFFFF;
    }

    //
    // Compute and cache the total number of flash sectors being used for emulation
    //
    uint32_t NUM_EEPROM_SECTORS_1 = FIRST_AND_LAST_SECTOR[1] - FIRST_AND_LAST_SECTOR[0] + 1;
    NUM_EEPROM_SECTORS = NUM_EEPROM_SECTORS_1;

    //
    // Make sure we have chosen at least 1 sector
    // and that the number of sectors is not more than those available on the device
    //
    if (NUM_EEPROM_SECTORS > NUM_FLASH_SECTORS || NUM_EEPROM_SECTORS == 0)
    {
        return 0xEEEE;
    }

    //
    // If using more than one sector
    //
    if (NUM_EEPROM_SECTORS > 1)
    {
        //
        // Make sure the chosen sectors are in the correct order and not duplicates
        //
        if (FIRST_AND_LAST_SECTOR[1] <= FIRST_AND_LAST_SECTOR[0])
        {
            return 0xEEEE;
        }

        //
        // Check to make sure sectors are in range for the device
        //
        if (FIRST_AND_LAST_SECTOR[1] > NUM_FLASH_SECTORS - 1 || FIRST_AND_LAST_SECTOR[1] < 1)
        {
            return 0xEEEE;
        }
    }

    //
    // If using a single sector, make sure it is in range
    //
    else if (FIRST_AND_LAST_SECTOR[0] > NUM_FLASH_SECTORS - 1 || FIRST_AND_LAST_SECTOR[1] > NUM_FLASH_SECTORS - 1)
    {
        return 0xEEEE;
    }

#ifdef PAGE_MODE
    //
    // Compute the total size of an EEPROM bank in bytes
    //
    Bank_Size = WRITE_SIZE_BYTES*2 + ((EEPROM_PAGE_DATA_SIZE + WRITE_SIZE_BYTES*2) * NUM_EEPROM_PAGES);

    //
    // Compute the total number of bytes available in the chosen memory range
    //
    uint32_t Available_Words = NUM_EEPROM_SECTORS * FLASH_SECTOR_SIZE;

    //
    // Ensure the EEPROM emulation will fit into the chosen memory range
    //
    if (Bank_Size * NUM_EEPROM_BANKS > Available_Words)
    {
        return 0xCCCC;
    }

#endif

    //
    // WARNINGS (Not Fatal)
    //
    uint8_t Warning_Flags = 0;

#ifdef PAGE_MODE
    //
    // Notify if there is extra space/room for another EEPROM bank.
    // If so, user should adjust NUM_EEPROM_BANKS and NUM_EEPROM_PAGES
    //
    if (Available_Words - (Bank_Size * NUM_EEPROM_BANKS ) >= Bank_Size)
    {
        Warning_Flags += 1;
    }

    //
    // If page data size is less than 64 bits, issue a warning.
    // 64-bit mode could be used to achieve the same effect
    // with better spatial efficiency
    //
    if (DATA_SIZE <= WRITE_SIZE_BYTES)
    {
        Warning_Flags += 2;
    }

#endif

    //
    // If both sectors > 31 (using mask B)
    //
    if (FIRST_AND_LAST_SECTOR[0] > 31 && FIRST_AND_LAST_SECTOR[1] > 31)
    {
        //
        // If not using the full 8 sectors, issue warning
        // These unused sectors will still be erased when the unit is full
        //
        if (NUM_EEPROM_SECTORS < 8)
        {
            Warning_Flags += 4;
        }

        //
        // If the sectors aren't a multiple of 8, issue a warning.
        // As each bit in mask B protects 8 sectors, there will be unused sectors
        // that are erased when the unit is full
        //
        else if ((FIRST_AND_LAST_SECTOR[0] % 8) != 0 || (FIRST_AND_LAST_SECTOR[1] + 1) % 8 != 0)
        {
            Warning_Flags += 4;
        }

