TexasInstruments/f29h85x-sdk/examples/driverlib/single_core/flash/F29H85x_EEPROM/F29H85x_EEPROM.c
    }
}

void EEPROM_UpdatePageStatus()
{
    Fapi_StatusType oReturnCheck;

    uint8_t Current_Page_Status = *(Page_Pointer);

    //
    // If our current page is blank, we don't need to mark it as used
    //
    if (Current_Page_Status == BLANK_PAGE)
    {
        return;
    }

    //
    // Otherwise, fill the bank status buffer
    //
    Fill_Buffer(Page_Status, status_buffer_len, CURRENT_PAGE);

    //
    // And write it to the end of the page status in flash, 
    // marking the page as used
    //
    EEPROM_Write_Buffer(Page_Pointer + WRITE_SIZE_BYTES, Page_Status);

    //
    // Increment the page pointer to the next page
    //
    Page_Pointer += EEPROM_PAGE_DATA_SIZE + WRITE_SIZE_BYTES*2;
}

void EEPROM_UpdatePageData(uint8_t* Write_Buffer)
{
    uint32_t i, Page_Offset;

    //
    // Program the Write_Buffer to flash in 64-bit increments
    //
    for(i = 0; i < EEPROM_PAGE_DATA_SIZE / WRITE_SIZE_BYTES; i++)
    {
        Page_Offset = WRITE_SIZE_BYTES*2 + (WRITE_SIZE_BYTES*i);
        EEPROM_Write_Buffer(Page_Pointer + Page_Offset, Write_Buffer + (i*WRITE_SIZE_BYTES));
    }

    //
    // Mark the page with our new data as current
    //
    Fill_Buffer(Page_Status, status_buffer_len, CURRENT_PAGE);
    EEPROM_Write_Buffer(Page_Pointer, Page_Status);

    Empty_EEPROM = 0;
}

void EEPROM_64_Bit_Mode_Check_EOS()
{
    uint8_t* End_Address = (uint8_t*) END_OF_SECTOR;

    //
    // If the EEPROM unit is full, then erase it
    //
    if (Bank_Pointer > End_Address - WRITE_SIZE_BYTES)
    {
        EEPROM_Erase();
    }
}

void EEPROM_Write_64_Bits(uint8_t Num_Bytes, uint8_t* Write_Buffer)
{
    //
    // Check and make sure we're still within our allocated memory range.
    // If not, erase and reset the pointers
    //
    EEPROM_64_Bit_Mode_Check_EOS();

    //
    // Pad the unused bits in the data buffer with 1s
    //
    uint8_t i;
    for (i = Num_Bytes; i < WRITE_SIZE_BYTES; i++)
    {
        Write_Buffer[i] = 0xFF;
    }

    //
    // Program the 64-bit data to flash
    //
    EEPROM_Write_Buffer(Bank_Pointer, Write_Buffer);

    //
    // Mark the EEPROM as containing data (we can safely read now)
    //
    Empty_EEPROM = 0;

    //
    // Update the pointer to the next empty set of 64 bits
    //
    Bank_Pointer += WRITE_SIZE_BYTES;
}

void Set_Protection_Masks()
{
    //
    // Compute the combined protectionmasks, then xor them to disable  
    // protection for writable/erasable sectors
    //
    uint64_t WE_Protection_AB_Mask = Configure_Protection_Masks(FIRST_AND_LAST_SECTOR, NUM_EEPROM_SECTORS);
    WE_Protection_A_Mask = 0xFFFFFFFF ^ (uint32_t)WE_Protection_AB_Mask;
    WE_Protection_B_Mask = 0x00000FFF ^ WE_Protection_AB_Mask >> 32;
}

void Sample_Error()
{
    //
    //  Error code will be in the status parameter
    //
    asm(" EMUSTOP0");
}

void Example_Done() {

    asm(" EMUSTOP0");

}

void FMSTAT_Fail(void)
{
    asm(" EMUSTOP0");
    for (;;);
}
